# CC_DeviceFromShape

## Description
Creates device from the given shape. The shape must be rectangle, rounded rectangle, polygon or polyline. Returns the handle of the created device.

```pascal
FUNCTION CC_DeviceFromShape(hObj : HANDLE) : HANDLE;
```

```python

def vs.CC_DeviceFromShape(hObj):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2022
## Category
* ConnectCAD